Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/arrests.html.txt.tmx
Source language: en
Languages: ga

source: An arrest is the apprehending or restraining of a person to bring that person to a District Court within a reasonable time
ga: Duine a thógáil nó a choinneáil agus a thabhairt ós comhair na Cúirte Dúiche taobh istigh d'achar réasúnta atá i gceist le gabháil

source: You can not be arrested for the purpose of gathering evidence or 'helping the Gardai with their enquiries'
ga: Ní féidir duine a ghabháil ar mhaithe le fianaise a bhailiú nó "le cúnamh a thabhairt do na Gardaí ina gcuid fiosrúchán"

source: You must be told why you are being arrested, for example, because you are suspected of having stolen goods
ga: Ní mór thú a chur ar an eolas cén fáth a bhfuil tú á ghabháil, mar shampla, mar gheall go bhfuiltear in amhras gur ghoid tú earraí

source: However, if you are arrested under Section 30 of the Offences Against the State Act 1939, you do not have to be told exactly why you are being arrested, you need only be told that you are being arrested under that section
ga: Má ghabhtar thú faoi Alt 30 den Acht um Chiontaí in Aghaidh an Stáit, 1939, ní gá thú a chur ar an eolas go díreach faoi cén fáth a bhfuil tú á ghabháil, ní gá ach a rá duit go bhfuil tú á ghabháil faoin alt sin

source: If you go voluntarily to a Garda station to assist the Gardai with their enquiries and are subjected to questioning or interrogation, you must be told and it must be clear to you that you are free to leave the station at any time unless you are arrested
ga: Má théann duine dá d(h)eoin féin chuig Stáisiún na nGardaí le cúnamh a thabhairt dóibh ina gcuid fiosrúchán agus má chuirtear ceisteanna air/uirthi ní mór a chur in iúl dó/dí gurb é sin atá ag tarlú agus ní mór do na Gardaí a dhéanamh soiléar dó/dí go bhfuil sé/síor leis an stáisiún a fhágáil ag am ar bith muna bhfuil sé/sí gafa acu

source: Often an arrest is on foot of a warrant
ga: Is minic go mbíonn barántas faighte le duine a ghabháil

source: However, a warrant is not always necessary
ga: Ach ní i gcónaí go mbíonn gá le barántas

source: You may be arrested without a warrant when a Garda, with reasonable cause, suspects that an arrestable offence has been committed and that you are guilty of the offence (Section 4 of the Criminal Law Act 1997)
ga: Is féidir duine a ghabháil gan barántas nuair atá Garda den tuairim, le fáth réasúnta, go bhfuil coir déanta agus go bhfuil an duine sin ciontach as an gcoir (Alt 4 den Acht an Dlí Coiriúil 1997)

source: An 'arrestable offence' is an offence for which the penalty, for a person who has no previous convictions, can be 5 years imprisonment or more
ga: Is ionann ‘cion inghabhála’ agus cion a bhféadfaí príosúnacht 5 bliana nó níos mó a ghearradh dá bharr, i gcás duine nach bhfuil aon chiontuithe aige/aici roimhe seo

source: Specific laws give the Gardaí specific powers of arrest as well
ga: Bronnann dlíthe sonracha cumhachtaí sonracha gabhála ar na Gardaí, chomh maith

source: For example, a Garda can arrest you under the Road Traffic Acts without a warrant if he/she suspects that you are committing an offence in relation to drinking and driving
ga: Mar shampla, féadfaidh Garda thú a ghabháil faoi na hAchtanna um Thrácht ar Bhóithre gan bharántas má bhíonn sé/sí in amhras go bhfuil cion á dhéanamh agat maidir le tiomáint faoi thionchar alcóil

source: Entry and search of a premises to carry out an arrest
ga: Iontráil in áitreabh agus an áit a chuardach le duine a ghabháil

source: If a Garda has obtained a warrant to arrest you, he or she may enter and search any premises where he or she suspects you to be
ga: Má tá barántas faighte ag Garda le duine a ghabháil tá sé de cheart aige/aici dul isteach in áitreabh agus an áit a chuardach má bhíonn sé/sí den tuairim go bhfuil an duine sin ann

source: He or she must identify himself or herself, demand entry and state why he or she is there
ga: Ní mór dó/dí féin a chur in iúl cé hé/í féin, cead iontrála a éileamh agus a rá cén fáth go bhfuil sé/sí ann

source: If the Garda is refused entry, he or she may break open outer and inner doors to get in
ga: Má dhiúltaítear don Gharda teacht isteach tá sé de cheart aige/aici doirse taobh amuigh agus istigh a bhriseadh le fáil isteach

source: When a Garda does not have an arrest warrant, he or she may enter and search any premises where he or she, with reasonable cause, suspects you to be
ga: Nuair nach bhfuil aon bharántas gafa ag an nGarda is féidir leis/léi dul isteach in áitreabh agus é a chuardach má tá cúis réasúnta aige/aici le ceapadh go bhfuil an duine ann

source: However, if the premises is a dwelling and he or she does not have the permission of the person who lives in the dwelling, the Garda cannot enter unless :
ga: Ach, más teach cónaithe atá i gceist ní féidir leis an nGarda teacht isteach gan cead ón duine a chónaíonn ann ach amháin sa chás:

source: • You live at the dwelling
ga: • Gurb é an té atá i gceist a ghabháil a chónaíonn ann

source: • The Garda has seen you inside or entering the dwelling or
ga: • Go bhfuil an duine feicthe taobh istigh nó ag dul isteach sa teach cónaithe ag an nGarda

source: • The Garda, with reasonable cause, suspects that before he or she can get an arrest warrant, you will either abscond or you will obstruct the course of justice or
ga: • Go gceapann an Garda, le cúis réasúnta, go n-éalóidh an duine nó go gcuirfidh an duine bac ar an dlí an fhad agus a bheadh barántas dhá lorg ag an nGarda nó

source: • He or she, with reasonable cause, suspects that before he or she can get an arrest warrant, you will commit an offence
ga: • Má cheapann an Garda, le cúis réasúnta, go mbeidh coir déanta ag an duine roimh a bheidh deis ag an nGarda barántas gafa a fháil

source: Force can only be used to make an arrest if it is absolutely necessary
ga: Ní féidir úsáid a bhaint as an láimh láidir le duine a ghabháil ach amháin sa chás go bhfuil sé fíor riachtanach

source: When a Garda arrests you, he or she will actually touch your body or otherwise restrain your liberty
ga: Nuair a ghabhann Garda duine beidh air/uirthi láimh a leagan ar a c(h)orp nó an duine a choinneáil ar bhealach eile

source: If you are arrested on a criminal charge, you must be informed at the time you are arrested of the charge unless this is very clear (for example, if you are arrested while committing an offence)
ga: Más coir choiriúil atá i gceist leis an ngabháil ní mór a chur in iúl don duine ag an am cén chúis atá le cur ina c(h)oinne ach amháin sa chás go bhfuil sé fíor shoileár (mar shampla, duine a bheadh gafa le linn dó/dí a bheith ag déanamh na coire)

source: After you have been charged, the Garda must caution you with the following words: "You are not obliged to say anything unless you wish to do so, but whatever you say will be taken down in writing and may be given in evidence."
ga: Tar éis duine a chúisiú ní mór don Gharda foláireamh mar seo a leanas a thabhairt dó/dí "Ní gá duit tada a rá muna bhfuil fonn ort, ach scríofar síos aon rud a dheireann tú agus d'fhéadfaí é a úsáid mar fhianaise."

source: When you are brought to the Garda station, details of the offence must be set out in a 'charge sheet'
ga: Nuair a thugtar duine chuig Stáisiún na nGardaí ní mór sonraí na coire a leagan amach ar "bhileog cúise"

source: A copy of the details must be given to you
ga: Ní mór cóip de na sonraí a thabhairt don té atá cúisithe

source: The Garda will formally charge you by reading each charge over to you and you will be cautioned after each charge is read out
ga: Déanfaidh an Garda an duine a chúisiú go foirmiúil tríd gach cúis a léamh agus tabharfar foláireamh don duine tar éis gach cúis a léamh amach

source: The Garda must keep a note of any reply you make
ga: Ní mór don Gharda nóta a dhéanamh d'aon fhreagra a thugann duine

source: Search of the arrested person
ga: An té atá gafa a chuardach

source: A Garda may search you after your arrest and take
ga: Is féidir le Garda an duine a chuardach tar éis é/í a ghabháil agus na nithe seo a leanas a thógáil

source: • articles that he or she believes to be connected with, or evidence relating to, the offence charged or
ga: • Nithe a cheapann sé/sí a bheith bainteach leis an gcoir, nó fianaise maidir leis an gcoir lena bhfuil an duine cúisithe

source: • articles that he or she believes to be connected with, or evidence relating to, some other offence or
ga: • Nithe a cheapann sé/sí a bheith bainteach leis an gcoir, nó fianaise maidir le aon choir eile nó

source: • articles that you might use to injure another person or property or to escape
ga: • Nithe go bhféadfadh duine a úsáid le é/í féin nó duine eile a ghortú nó le damáiste a dhéanamh do mhaoin nó le héalú

source: Once you are charged and cautioned, you must be
ga: Nuair atá duine cúisithe agus forláireamh tugtha, ní mór an duine

source: • released on bail by the member in charge of the station (a form of bail known as station bail)
ga: • A scaoileadh amach ar bhannaí faoi chúram an té atá i gceannas an stáisiúin (bannaí ar a dtugtar bannaí stáisiúin nó

source: • transferred from the Garda Station to the District Court as soon as reasonably possible
ga: • A thabhairt ó stáisiún na nGardaí chuig an gCúirt Dúiche chomh luath agus is féidir

source: If you are arrested after 5 p.m
ga: Más tar éis 5i.n

source: you may be brought to the District Court as early as possible before noon the following day
ga: a dhéantar duine a ghabháil is féidir an duine a thabhairt ós comhair na Cúirte Dúiche chomh luath agus is féidir roimh an meán lae an lá dár gcionn

source: At the District Court, you may be released on bail or remanded in custody by the judge
ga: Is féidir leis an mBreitheamh sa Chúirt Dúiche an duine a shaorú ar bhannaí nó a choinneáil siar faoi athchúirt

source: Only in certain specific circumstances may you be detained in a Garda Station for a length of time before being brought to court
ga: Ní féidir tú a choinneáil i stáisiún Garda ach amháin i gcúinsí áirithe ar feadh tréimhse ama sula dtugtar chun cúirte tú

source: Under the Criminal Justice Act 1984, you may be detained in a Garda Station for up to 12 hours
ga: Faoin Acht um Cheartas Coiriúil 1984, is féidir tú a choinneáil i stáisiún Garda ar feadh chomh fada le 12 uair

source: The offence of which you are suspected must be one that may be punished by imprisonment for at least 5 years
ga: Caithfidh an cion a bhfuiltear in amhras fút ina leith a bheith mar cheann a d’fhéadfaí pionós na príosúnachta a ghearradh air ar feadh 5 bliana ar a laghad

source: The 12 hour period runs from the time of your arrest but you may agree to a rest period between 12 midnight and 8 am and this will not be included in the 12 hours
ga: Ritheann an tréimhse 12 uair ón tráth a ghabhtar tú, ach féadann tú aontú ar thréimhse scíthe idir 12 meánoíche agus 8 r.n., agus ní áireofar leis an 12 uair í seo

source: In general, if you are arrested you do not have to say anything
ga: Má ghabhtar tú, ní chaitheann tú aon ní a rá de ghnáth

source: However, if you are detained under the Criminal Justice Act 1984 you must tell the Gardai your name and address
ga: Má ghabhtar tú faoin Acht um Cheartas Coiriúil 1984, ámh, ní mór duit d'ainm agus seoladh a insint do na Gardaí

source: The Gardai have no general power to take fingerprints or make forensic tests
ga: Níl aon chumhacht ghinearálta ag na Gardaí le méarloirg a ghabháil ná le tástálacha fóiréinseacha a dhéanamh

source: They may do these things if you consent or if they have specific power under specific laws, for example, under the Offences Against the State Act or the Criminal Law (Jurisdiction) Act of 1976
ga: Féadann siad na nithe sin a dhéanamh má thoilíonn tú, nó má bhíonn cumhacht faoi leith acu de réir dlíthe ar leith, mar shampla, de réir an Achta um Chiontaí in aghaidh an Stáit nó an tAcht um an Dlí Coiriúil de 1976

source: Under Section 30 of the Offences Against the State Act you may be detained for up to 48 hours before being brought to Court
ga: Faoi réir Alt 30 den Acht um Chiontaí in aghaidh an Stáit; féadtar tú a choinneáil ar feadh chomh fada le 48 uair sula dtugtar os comhair na Cúirte tú

source: If you are detained you must be informed of your right to consult a solicitor
ga: Más amhlaidh tú a bheith faoi choinneáil, ní mór tú a chur ar an eolas faoi do cheart chun dul i gcomhairle le dlíodóir

source: See our document on treatment in custody
ga: Féach ar ár ndoiciméad maidir le cóireáil i gcoimeád

source: • Ambassadors and their suites and other diplomatic agents who represent foreign governments while living in this country cannot be arrested
ga: • Ní féidir ambasadóirí agus a gcoimhdeacht agus oifigigh taidhleoireachta eile a dhéanann ionadaíocht ar son rialtas eachtranach a ghabháil nuair atá cónaí sa tír seo orthu

source: • Members of each House of the Oireachtas cannot be arrested while going to, returning from and within the confines of either House of the Oireachtas, except in the case of treason, felony or breach of peace
ga: • Ní féidir baill de Thithe an Oireachtais a ghabháil ar a mbealach chuig, ó agus taobh istigh de cheachtar den dá Theach Oireachtais, ach amháin sa chás go bhfuil tréas, feileonacht nó briseadh síochána i gceist
